{
    "meta": {
      "version": "1.0",
      "generated_for": "UPangea MCAT Astro Date Picker",
      "note": "3–4 sentence horoscope-style copy for each test date. Plain text blocks suitable for UI cards or detail views."
    },
    "astro_copy": {
      "2025": [
        {
          "date": "July 25, 2025",
          "text": "Leo fire puts you center stage, boosting confidence and charisma. But with Mercury retrograde in Leo, shiny first impressions can mask small mistakes. Slow your roll, read twice, and let Mars-in-Virgo polish your pacing. Arrive early and double-check every detail."
        },
        {
          "date": "August 1, 2025",
          "text": "A Scorpio First Quarter Moon fuels deep focus and relentless drive. Emotions run strong, which can sharpen insight or tip into overthinking. Mercury retrograde asks for meticulous logistics and careful reading of instructions. Keep a checklist and move on when stuck."
        },
        {
          "date": "August 16, 2025",
          "text": "Taurus Moon brings calm, steady endurance and dependable focus. With Mercury direct, the gears finally turn cleanly. Expect a low-drama, methodical groove that rewards consistent pacing over flash. Warm up well, then trust your plan and follow it."
        },
        {
          "date": "August 22, 2025",
          "text": "Late Leo energy lights motivation and expressive thinking. Confidence is a plus, but rushing is the trap. Balance the showtime vibe with measured breaths and deliberate reads. Make bold choices only after the text backs you up."
        },
        {
          "date": "August 23, 2025",
          "text": "New Moon reset meets Virgo order, giving fresh, organized focus. The day favors clean starts, tidy notes, and simple structures. Mercury in Leo adds flair—great if you ground it in evidence. Warm up, then let clarity lead the way."
        },
        {
          "date": "September 4, 2025",
          "text": "Virgo Mercury and a Capricorn Moon craft a practical, disciplined tone. Detail work clicks, and structure feels natural. Watch for perfection spirals under Saturn’s pressure. Cap questions at time limits and keep your elimination crisp."
        },
        {
          "date": "September 5, 2025",
          "text": "Aquarius Moon lifts objectivity while Virgo Mercury keeps your mechanics sharp. It’s a clean, airy headspace for CARS reasoning. Guard against detachment by using timers and quick recaps. Choose what the text proves, not what sounds clever."
        },
        {
          "date": "September 12, 2025",
          "text": "Taurus Moon plus Virgo Mercury favors precision over spectacle. The vibe is grounded, consistent, and unhurried. Commit when reasonably confident and skip the endless tinkering. Rituals—sleep, breakfast, pacing—carry you smoothly."
        },
        {
          "date": "September 13, 2025",
          "text": "Gemini Moon sparks agile thinking and quick pattern spotting. Virgo Mercury anchors accuracy so speed doesn’t slip into sloppiness. Channel momentum into scanning, not second-guessing. Mark claims and evidence to keep your thread tight."
        }
      ],
      "2026": [
        {
          "date": "January 9, 2026",
          "text": "Capricorn stakes the day: disciplined, serious, and built for stamina. Virgo Moon sharpens review and careful edits. The energy can feel heavy—insert micro-resets to stay supple. Trust your pacing grid and execute."
        },
        {
          "date": "January 10, 2026",
          "text": "Capricorn structure meets Libra balance for steady, fair decisions. The mood is even-keeled with clean tradeoffs. Don’t linger in indecision—choose, note, and move. Momentum is your quiet superpower."
        },
        {
          "date": "January 15, 2026",
          "text": "Capricorn mastery blends with Sagittarius perspective for method and meaning. Saturn’s station can feel sticky at times. Keep big-picture clarity without losing the small print. When stuck, pivot briefly and return fresher."
        },
        {
          "date": "January 23, 2026",
          "text": "Aquarius clarity pairs with a soft Pisces Moon, mixing analysis with empathy. It’s a good day for abstraction and tone sensitivity. Guard against dreamy drift with sharp notes and timers. Let fairness and evidence co-lead."
        },
        {
          "date": "February 13, 2026",
          "text": "Capricorn Moon grounds you, but Saturn’s station can make the start choppy. Expect smoother flow after a solid warm-up. Keep notes compact and functional. Build early wins to lock in rhythm."
        },
        {
          "date": "March 7, 2026",
          "text": "Pisces Mercury opens intuitive reading while Libra Moon steadies your reviews. Inference flows when you anchor it to lines. Beware the pleasant haze—proof beats vibe. Gentle structure keeps the magic useful."
        },
        {
          "date": "March 20, 2026",
          "text": "Aries Moon delivers decisive, competitive spark. Motivation is high and momentum builds fast. Count to three before locking quick answers. Fuel well so the late game stays sharp."
        },
        {
          "date": "April 10, 2026",
          "text": "Aries drive gets you out of the gate strong, while Capricorn Moon finishes the job. Start assertive, end steady. Write down the thesis to prevent drift. One posture reset mid-section works wonders."
        },
        {
          "date": "April 11, 2026",
          "text": "Aquarius Moon cools the head; Aries keeps energy up. It’s clear, objective, and brisk. Confidence is great—just tether it to text. Mark-and-move keeps the engine humming."
        },
        {
          "date": "April 24, 2026",
          "text": "Taurus Sun builds consistency; Leo Moon lends presence. Mercury in Aries wants to jump ahead—invite patience to the party. Slow the first questions of each passage on purpose. Change answers only with fresh evidence."
        },
        {
          "date": "April 25, 2026",
          "text": "Warm Leo Moon meets quick Mercury in Aries for bold, decisive choices. Verbal flow is smooth and lively. Insert tiny pauses to keep speed from outrunning accuracy. Confidence plus receipts beats swagger alone."
        },
        {
          "date": "May 2, 2026",
          "text": "Scorpio Moon brings depth and stamina; Aries Mercury snaps conclusions into place. Intensity is an asset if you zoom out after each paragraph. Don’t let passion tunnel your view. Breathe, reset, proceed."
        },
        {
          "date": "May 8, 2026",
          "text": "Earth energy favors method and momentum. Patience, structure, and elimination shine brighter than flash. If it feels slow, that’s okay—steady wins. Choose the most supported answer and move."
        },
        {
          "date": "May 9, 2026",
          "text": "Aquarius Moon encourages synthesis while Taurus Mercury keeps edges clean. It’s an objective, grounded headspace. Re-read stems that seem too easy. Map each choice to a sentence and keep tempo brisk."
        },
        {
          "date": "May 14, 2026",
          "text": "Aries Moon lights fast comprehension; Taurus Mercury keeps your hands steady. Great conditions for confident starts and careful finishes. Draft the thesis before diving into options. Pace, don’t chase."
        },
        {
          "date": "May 22, 2026",
          "text": "Gemini Sun and Mercury make your inner narrator lively and quick. Leo Moon adds boldness to your selections. Watch for skimming—tone words love to trick. Summarize tight and keep distractions out."
        },
        {
          "date": "May 30, 2026",
          "text": "Curiosity meets composure as Gemini speed pairs with Scorpio depth. You can pivot fast and still drill down when needed. Avoid over-digging where text is thin. Reset attention at the midpoint."
        },
        {
          "date": "June 12, 2026",
          "text": "Taurus Moon calms the pace while Cancer Mercury boosts recall. The vibe is supportive, steady, and memory-friendly. Anchor each choice to a line and skip sentimentality. Manage energy to dodge the afternoon dip."
        },
        {
          "date": "June 13, 2026",
          "text": "Comfort and consistency headline the day. Taurus steadies your rhythm; Cancer Mercury helps details stick. Use checkpoints to avoid slowing too much. Review only what’s flagged and keep posture open."
        },
        {
          "date": "June 26, 2026",
          "text": "Intensity can work for you as Cancer memory and Scorpio focus sync up. Emotions color the read—notice them, then return to evidence. Name the author’s purpose clearly. Short resets keep depth productive."
        },
        {
          "date": "June 27, 2026",
          "text": "Sagittarius Moon lifts optimism and speeds decisions. Cancer Mercury protects the details you need. Force second reads on nuanced stems. Hydrate and keep a confident, even cadence."
        },
        {
          "date": "July 11, 2026",
          "text": "Gemini Moon brings light, nimble flexibility. Cancer Mercury preserves the fine print. Anchor choices to line numbers to curb hopscotch mind. Mini-breaks keep attention fresh and bright."
        },
        {
          "date": "July 24, 2026",
          "text": "Leo Sun lends presence while Scorpio Moon digs for proof. You’re confident and probing—great combo when tied to text. Beware confirmation bias. Protect your focus bubble from other people’s drama."
        },
        {
          "date": "July 31, 2026",
          "text": "Aquarius Moon cools the take while Leo Sun fuels drive. It’s objective with a bold edge. If you feel detached, re-engage with the author’s voice. Evidence remains the final judge."
        },
        {
          "date": "August 15, 2026",
          "text": "Virgo Moon tidies thoughts; Leo Mercury clarifies the headline. Social ease smooths nerves without stealing focus. Timebox reviews to avoid perfection spirals. Simple symbols keep notes crisp."
        },
        {
          "date": "August 21, 2026",
          "text": "Sagittarius Moon brings fast, clear momentum. Leo Mercury sharpens summaries and delivery. Insert deliberate slows on tricky inference. Breath resets keep excitement productive."
        },
        {
          "date": "August 22, 2026",
          "text": "Decisive, upbeat energy favors quick synthesis and bold choices. Great for performers who thrive with adrenaline. Require textual receipts before locking. Count to three when racing ahead."
        },
        {
          "date": "September 3, 2026",
          "text": "Virgo season precision meets Taurus steadiness for structured accuracy. It’s a day for clean pacing and evidence-based elimination. Beware perfection time traps. Reset posture between passages and carry on."
        },
        {
          "date": "September 4, 2026",
          "text": "Gemini Moon lifts curiosity; Virgo Mercury keeps your framework tight. Mental lightness meets reliable accuracy. Annotate claims versus support to prevent hopping. Finish with time to review."
        },
        {
          "date": "September 11, 2026",
          "text": "Double Virgo discipline sets a serious, efficient tone. Mercury freshly in Libra adds fairness to weighing options. Avoid self-critique loops by honoring ‘good enough.’ Let structure do the heavy lifting."
        },
        {
          "date": "September 12, 2026",
          "text": "Libra Moon and Mercury emphasize balance, perspective, and clean handoffs. Virgo Sun keeps mechanics crisp. Limit revisits and stick to what the text actually says. Choose the most text-bounded answer when in doubt."
        }
      ]
    }
  }
  